Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.PropertyNotClosed
Property lines do not form a closed loop.  Area will not be computed.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningRemovesHost
Opening completely removes its host.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningRectDoesnotCutHost
Rectangular opening doesn't cut its host.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningPartiallyCutsHost
Opening partially cuts its host.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningNegativeHeight
The top of the Opening is lower than the bottom of the Opening or coincident with it.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningDoesnotCutHostDelete
Opening does not cut its host.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningDoesnotCutHost
Opening does not cut its host.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningCutAll
Opening completely removes its host

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpenStringerConflictNosing
Open stringer can't be created for selected nosing profile. Set nosing profile to default to get open stringers created.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.InvalidComplexCut
The family [Family Name] was containing one or more invalid cuts, which have been removed (most likely it was cutting
a curtain wall). Please examine the family and make changes as needed.\r\nHint 1: If you are trying to cut a Curtain
Wall, you may be able to achieve the desired result by editing the Elevation Profile or the curtain panel.\r\n
Hint 2: If you can't see the family, you can still select it from the Project Browser.\r\nHint 3: This warning will
disappear after you edit and then finish the family.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.HostForCutHasNoGeometryWarn
Host can't be cut because it has no geometry.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.HostForCutHasNoGeometry
Host can't be cut because it has no geometry.

Autodesk.Revit.DB.BuiltInFailures.OpeningFailures
Failures about Opening.